# Створіть програму, яка складається з функції, яка приймає три числа і повертає їх середнє арифметичне,
# і головного циклу, що запитує у користувача числа і обчислює їх середні значення за допомогою створеної функції.

def average():
    a = int(input("Введіть число a: "))
    b = int(input("Введіть число b: "))
    c = int(input("Введіть число c: "))
    ave = (a + b + c) / 3
    print(ave)
    return(ave)


x = 1


while x:
    average()
    print("1. Продовжити\n2.Вихід")
    x = int(input("Оберіть необхідний варіант: "))
    if x == 1:
        continue
    elif x == 2:
        x = 0
    else:
        print("Оберіть 1 або 2")
        x = 1