# Створіть програму, яка приймає як формальні параметри зріст і вагу користувача,
# обчислює індекс маси тіла і в залежності від результату повертає інформаційне повідомлення
# (маса тіла в нормі, недостатня вага або слідкуйте за фігурою).
# Користувач з клавіатури вводить значення росту та маси тіла та передає ці дані у вигляді фактичних параметрів
# під час виклику функції. Програма працює доти, доки користувач не зупинить її комбінацією символів «off».

def mass():
    weight = float(input("Введіть свою вагу у кг: "))
    growth = float(input("Введіть свій зріст у см: "))
    growth = growth / 100
    bmi = weight / (growth ** 2)
    print("Your bmi =", bmi.__round__(2))
    if bmi <= 16:
        print("Виражений дефіцит маси тіла")
    elif bmi > 16 and bmi <= 18.5:
        print("Недостатня маса")
    elif bmi > 18.5 and bmi <= 25:
        print("Норма")
    elif bmi > 25 and bmi <= 30:
        print("Передожиріння (гладкість)")
    elif bmi > 30 and bmi <= 35:
        print("Ожиріння I ступеня")
    elif bmi > 35 and bmi <= 40:
        print("Ожиріння II ступеня")
    elif bmi > 40 and bmi <= 100:
        print("Ожиріння III ступеня")
    else:
        print("You potato")

x = 1

while x:
    mass()
    print("Щоб вийти з програми напишіть 'off'")
    way = input("Або натисніть Enter, щоб продовжити.\n")
    if way == "off":
        x = 0
    else:
        x = 1


