# Створіть програму-калькулятор, яка підтримує наступні операції:
# додавання, віднімання, множення, ділення, зведення в ступінь, зведення до квадратного та кубічного коренів.
# Всі дані повинні вводитися в циклі, доки користувач не вкаже, що хоче завершити виконання програми.
# Кожна операція має бути реалізована у вигляді окремої функції.
# Функція ділення повинна перевіряти дані на коректність та видавати повідомлення про помилку
# у разі спроби поділу на нуль.

import math

def inp_a():
    a = int(input("Введіть ціле число a: "))
    return(a)

def inp_b():
    b = int(input("Введіть ціле число b: "))
    return(b)

def summa ():
    print("Сума a + b:", inp_a() + inp_b())

def minus ():
    print("Залишок від a - b:", inp_a() - inp_b())
    return

def dob ():
    print("Результат множення a * b:", inp_a() * inp_b())
    return

def delenie ():
    a = inp_a()
    b = inp_b()
    if b != 0:
        result = a / b
        print("Результат ділення a / b:", result)
    else:
        print("На нуль ділити не можливо.")
    return

def stepen ():
    print("a в ступіні b:", inp_a() ** inp_b())
    return

def koren_2 ():
    print("Корінь a:", math.sqrt(inp_a()))

def koren_3 ():
    print("Кубічний корінь a:", (inp_a() ** (1/3)))



print("Оберіть необхідний варіант серед наведених нижче.")
print("""1. Додавання\n2. Віднімання\n3. Множення\n4. Ділення
5. Зведення в ступінь\n6. Зведення до квадратного кореня.\n7.Зведення до кубічного кореня.""")


way = int(input("Оберіть необхідний варіант: "))
x = 1


while x:
    if way == 1:
        summa()
        x = int(input("1. Продовжити.\n0. Вихід.\nОберіть необхідне: "))
    elif way == 2:
        minus()
        x = int(input("1. Продовжити.\n0. Вихід.\nОберіть необхідне: "))
    elif way == 3:
        dob()
        x = int(input("1. Продовжити.\n0. Вихід.\nОберіть необхідне: "))
    elif way == 4:
        delenie()
        x = int(input("1. Продовжити.\n0. Вихід.\nОберіть необхідне: "))
    elif way == 5:
        stepen()
        x = int(input("1. Продовжити.\n0. Вихід.\nОберіть необхідне: "))
    elif way == 6:
        koren_2()
        x = int(input("1. Продовжити.\n0. Вихід.\nОберіть необхідне: "))
    elif way == 7:
        koren_3()
        x = int(input("1. Продовжити.\n0. Вихід.\nОберіть необхідне: "))


